# Query Fundamentals

## Select From

> - Select every column from the customer table

In [5]:
%%sql

select * from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1)]

> - Selecting a single column <br>
> - Select email column from customer table

In [6]:
%%sql

select email from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('MARY.SMITH@sakilacustomer.org',),
 ('PATRICIA.JOHNSON@sakilacustomer.org',),
 ('LINDA.WILLIAMS@sakilacustomer.org',),
 ('BARBARA.JONES@sakilacustomer.org',),
 ('ELIZABETH.BROWN@sakilacustomer.org',)]

> - Selecting multple columns from a table <br>
> - Selecting first name, last name, and email from the customer table

In [8]:
%%sql

select first_name, last_name, email from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org'),
 ('PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org'),
 ('LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org'),
 ('BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org'),
 ('ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org')]

remember to add ERDiagram here

> - An aliasing example
> - Changing column names

In [10]:
%%sql

select first_name as "First Name", last_name as "Last Name" from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('MARY', 'SMITH'),
 ('PATRICIA', 'JOHNSON'),
 ('LINDA', 'WILLIAMS'),
 ('BARBARA', 'JONES'),
 ('ELIZABETH', 'BROWN')]

## Derived Columns

In [13]:
%%sql 

select * from film
limit 1;

 * postgresql://postgres:***@localhost/videoezy
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2007, 9, 10, 17, 46, 3, 905795), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17")]

> - Converting rental duration (days) to rental_duration (hours)

In [18]:
%%sql

select 
    title, 
    rental_duration, 
    (rental_duration * 24) as "rental duration (hrs)"
from film
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACADEMY DINOSAUR', 6, 144),
 ('ACE GOLDFINGER', 3, 72),
 ('ADAPTATION HOLES', 7, 168),
 ('AFFAIR PREJUDICE', 5, 120),
 ('AFRICAN EGG', 6, 144)]

In [20]:
%%sql

select rental_date, return_date from rental
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(datetime.datetime(2005, 5, 24, 22, 54, 33), datetime.datetime(2005, 5, 28, 19, 40, 33)),
 (datetime.datetime(2005, 5, 24, 23, 3, 39), datetime.datetime(2005, 6, 1, 22, 12, 39)),
 (datetime.datetime(2005, 5, 24, 23, 4, 41), datetime.datetime(2005, 6, 3, 1, 43, 41)),
 (datetime.datetime(2005, 5, 24, 23, 5, 21), datetime.datetime(2005, 6, 2, 4, 33, 21)),
 (datetime.datetime(2005, 5, 24, 23, 8, 7), datetime.datetime(2005, 5, 27, 1, 32, 7))]

> - Computing the difference between return_date and rental_date

In [22]:
%%sql

select rental_date, return_date, return_date - rental_date as "duration" from rental
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(datetime.datetime(2005, 5, 24, 22, 54, 33), datetime.datetime(2005, 5, 28, 19, 40, 33), datetime.timedelta(days=3, seconds=74760)),
 (datetime.datetime(2005, 5, 24, 23, 3, 39), datetime.datetime(2005, 6, 1, 22, 12, 39), datetime.timedelta(days=7, seconds=83340)),
 (datetime.datetime(2005, 5, 24, 23, 4, 41), datetime.datetime(2005, 6, 3, 1, 43, 41), datetime.timedelta(days=9, seconds=9540)),
 (datetime.datetime(2005, 5, 24, 23, 5, 21), datetime.datetime(2005, 6, 2, 4, 33, 21), datetime.timedelta(days=8, seconds=19680)),
 (datetime.datetime(2005, 5, 24, 23, 8, 7), datetime.datetime(2005, 5, 27, 1, 32, 7), datetime.timedelta(days=2, seconds=8640))]

> - Concatenating two column

In [26]:
%%sql 

select
    first_name,
    last_name,
    first_name || ' ' || last_name as "full name"
from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('MARY', 'SMITH', 'MARY SMITH'),
 ('PATRICIA', 'JOHNSON', 'PATRICIA JOHNSON'),
 ('LINDA', 'WILLIAMS', 'LINDA WILLIAMS'),
 ('BARBARA', 'JONES', 'BARBARA JONES'),
 ('ELIZABETH', 'BROWN', 'ELIZABETH BROWN')]

> - initcap converts the first letter or each word to uppercase.

In [31]:
%%sql 

select
    first_name,
    last_name,
    initcap(first_name || ' ' || last_name) as "full name"
from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('MARY', 'SMITH', 'Mary Smith'),
 ('PATRICIA', 'JOHNSON', 'Patricia Johnson'),
 ('LINDA', 'WILLIAMS', 'Linda Williams'),
 ('BARBARA', 'JONES', 'Barbara Jones'),
 ('ELIZABETH', 'BROWN', 'Elizabeth Brown')]

## Filtering with WHERE

In [35]:
%%sql

select * 
from film
limit 1;

 * postgresql://postgres:***@localhost/videoezy
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2007, 9, 10, 17, 46, 3, 905795), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17")]

> - List of available comparison operators : =, <, >, <=, >=, != or <>

> - grabbing title and rental duration where rental duration is equal to 5

In [38]:
%%sql

select title, rental_duration
from film
where rental_duration = 5
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('AFFAIR PREJUDICE', 5),
 ('ALIEN CENTER', 5),
 ('ANTHEM LUKE', 5),
 ('ANTITRUST TOMATOES', 5),
 ('APACHE DIVINE', 5)]

In [40]:
%%sql

select * from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1)]

> - when writing in string literals use single quotes
> - double quotes are only used for table or column identifiers

In [41]:
%%sql

select * from customer
where first_name = 'MARY';

 * postgresql://postgres:***@localhost/videoezy
1 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1)]

In [42]:
%%sql

select * from customer
where lower(first_name) = 'mary';

 * postgresql://postgres:***@localhost/videoezy
1 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1)]

> - grab rows where rental date is greater or equal than '2006-01-01'

In [44]:
%%sql

select * 
from rental 
where rental_date >= '2006-01-01'
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(13421, datetime.datetime(2006, 2, 14, 15, 16, 3), 9, 366, None, 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (15542, datetime.datetime(2006, 2, 14, 15, 16, 3), 21, 111, None, 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (15458, datetime.datetime(2006, 2, 14, 15, 16, 3), 25, 590, None, 2, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (15294, datetime.datetime(2006, 2, 14, 15, 16, 3), 70, 108, None, 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (12988, datetime.datetime(2006, 2, 14, 15, 16, 3), 81, 236, None, 2, datetime.datetime(2006, 2, 16, 2, 30, 53))]

> grab row value where rental date is exactly '2005-05-24 22:54:33'

In [46]:
%%sql

select * 
from rental 
where rental_date = '2005-05-24 22:54:33';

 * postgresql://postgres:***@localhost/videoezy
1 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 16, 2, 30, 53))]

> grab row value where rental date is greater than '2005-05-24 22:54:33'

In [48]:
%%sql

select * 
from rental 
where rental_date > '2005-05-24 22:54:33'
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (7, datetime.datetime(2005, 5, 24, 23, 11, 53), 3995, 269, datetime.datetime(2005, 5, 29, 20, 34, 53), 2, datetime.datetime(2006, 2, 16, 2, 30, 53))]

## AND, OR, and NOT

In [51]:
%%sql

select title, rental_duration, length
from film
where length > 100 and rental_duration = 5
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('AFFAIR PREJUDICE', 5, 117),
 ('ANTITRUST TOMATOES', 5, 168),
 ('APOLLO TEEN', 5, 153),
 ('ARTIST COLDBLOODED', 5, 170),
 ('ATTACKS HATE', 5, 113)]

In [52]:
%%sql

select title, rental_duration, length
from film
where length > 100 or rental_duration = 5
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('AFFAIR PREJUDICE', 5, 117),
 ('AFRICAN EGG', 6, 130),
 ('AGENT TRUMAN', 3, 169),
 ('ALABAMA DEVIL', 3, 114),
 ('ALAMO VIDEOTAPE', 6, 126)]

In [53]:
%%sql

select title, rental_duration, length
from film
where length > 100 
    or rental_duration = 5
    or left(title, 1) = 'A'
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACADEMY DINOSAUR', 6, 86),
 ('ACE GOLDFINGER', 3, 48),
 ('ADAPTATION HOLES', 7, 50),
 ('AFFAIR PREJUDICE', 5, 117),
 ('AFRICAN EGG', 6, 130)]

In [55]:
%%sql

select title, rental_duration, length
from film
where (length > 100 or rental_duration = 5)
    and left(title, 1) = 'A'
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('AFFAIR PREJUDICE', 5, 117),
 ('AFRICAN EGG', 6, 130),
 ('AGENT TRUMAN', 3, 169),
 ('ALABAMA DEVIL', 3, 114),
 ('ALAMO VIDEOTAPE', 6, 126)]

In [56]:
%%sql

select title, rental_duration, length
from film
where not rental_duration = 5
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACADEMY DINOSAUR', 6, 86),
 ('ACE GOLDFINGER', 3, 48),
 ('ADAPTATION HOLES', 7, 50),
 ('AFRICAN EGG', 6, 130),
 ('AGENT TRUMAN', 3, 169)]

## Null Handling

> - selects rows where email is null

In [57]:
%%sql

select * from customer
where email is null;

 * postgresql://postgres:***@localhost/videoezy
2 rows affected.

[(53, 1, 'HEATHER', 'MORRIS', None, 57, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (101, 1, 'PEGGY', 'MYERS', None, 105, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1)]

> - selects rows where email is not null

In [59]:
%%sql

select * from customer
where email is not null
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1),
 (5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, True, datetime.date(2006, 2, 14), datetime.datetime(2006, 2, 15, 9, 57, 20), 1)]

> - selects rating where rating is not PG including where rating is null

In [62]:
%%sql

select title, rating
from film 
where rating != 'PG'
    or rating is null
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACE GOLDFINGER', 'G'),
 ('ADAPTATION HOLES', 'NC-17'),
 ('AFFAIR PREJUDICE', 'G'),
 ('AFRICAN EGG', 'G'),
 ('AIRPLANE SIERRA', 'PG-13')]

## IN, BETWEEEN, and LIKE

> - selecting customer_id between 1 and 5

In [64]:
%%sql

select customer_id
from customer
where customer_id between 1 and 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(1,), (2,), (3,), (4,), (5,)]

> - selecting customer_id not between 1 and 5

In [67]:
%%sql

select customer_id
from customer
where customer_id not between 1 and 5
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(6,), (7,), (8,), (9,), (10,)]

In [68]:
%%sql

select customer_id
from customer
where customer_id in (1, 5, 8);

 * postgresql://postgres:***@localhost/videoezy
3 rows affected.

[(1,), (5,), (8,)]

In [70]:
%%sql

select customer_id
from customer
where customer_id not in (1, 5, 8)
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(2,), (3,), (4,), (6,), (7,)]

In [72]:
%%sql

select first_name
from customer
where left(first_name, 1) in ('A', 'F', 'J')
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('JENNIFER',), ('JESSICA',), ('ANGELA',), ('AMY',), ('ANNA',)]

> - the first_name has to match the pattern starting with the letter M

In [75]:
%%sql

select first_name from customer
where first_name like 'M%'
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('MARY',), ('MARIA',), ('MARGARET',), ('MICHELLE',), ('MELISSA',)]

> - return the first_name where the third character in the string starts with the letter M

In [79]:
%%sql

select first_name from customer
where first_name like '__M%'
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('KIMBERLY',), ('PAMELA',), ('TAMMY',), ('KIM',), ('EMMA',)]

> - disregards case-sensitivity

In [80]:
%%sql

select first_name from customer
where first_name ilike '__m%'
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('KIMBERLY',), ('PAMELA',), ('TAMMY',), ('KIM',), ('EMMA',)]

## ORDER BY

> - films have been sorted by length desc

In [85]:
%%sql

select title, length
from film
order by length desc
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('VIRGIN DAISY', None),
 ('BEAST HUNCHBACK', None),
 ('DARN FORRESTER', 185),
 ('CHICAGO NORTH', 185),
 ('CONTROL ANTHEM', 185)]

> - films have been sorted by length desc
> - so films with the longest length
> - nulls have been put last

In [89]:
%%sql

select title, length
from film
order by length desc nulls last
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('GANGS PRIDE', 185),
 ('CONTROL ANTHEM', 185),
 ('DARN FORRESTER', 185),
 ('CHICAGO NORTH', 185),
 ('HOME PITY', 185)]

> - films have been sorted first by length, but if any two films have the same length then they are sorted by title

In [90]:
%%sql

select title, length
from film
order by length, title
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('APOCALYPSE FLAMINGOS', 0),
 ('ALIEN CENTER', 46),
 ('IRON MOON', 46),
 ('KWAI HOMEWARD', 46),
 ('LABYRINTH LEAGUE', 46)]

> - sort by length desc, but if any of the films have the same length then we sort by title

In [92]:
%%sql

select title, length
from film
order by length desc, title asc
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('BEAST HUNCHBACK', None),
 ('VIRGIN DAISY', None),
 ('CHICAGO NORTH', 185),
 ('CONTROL ANTHEM', 185),
 ('DARN FORRESTER', 185)]

> - order by the last character in the title then order by length desc

In [98]:
%%sql

select title, length
from film
order by right(title, 1), length desc
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('BAKED CLEOPATRA', 182),
 ('LESSON CLEOPATRA', 167),
 ('FINDING ANACONDA', 156),
 ('COLOR PHILADELPHIA', 149),
 ('FIREBALL PHILADELPHIA', 148)]

In [109]:
%%sql

select title, rental_rate, replacement_cost, ceil(replacement_cost / rental_rate) as break_even
from film
order by break_even desc
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('BONNIE HOLOCAUST', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('CLOCKWORK PARADISE', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('BALLROOM MOCKINGBIRD', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('ARABIA DOGMA', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('CLYDE THEORY', Decimal('0.99'), Decimal('29.99'), Decimal('31'))]

## SQL Order of execution

The processing of a SQL statement:
> - from : pick the tables to be queried
> - where : filter the rows
> - group by : aggregate rows together
> - having : filter the aggregates
> - select : select the columns that appear in the output
> - order by : sorts the rows
> - limit : limit the number of return rows

F-W-GB-H-S-OB-L

In [110]:
%%sql

select title, rental_rate, replacement_cost, ceil(replacement_cost / rental_rate) as break_even
from film
order by ceil(replacement_cost / rental_rate) desc
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('BONNIE HOLOCAUST', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('CLOCKWORK PARADISE', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('BALLROOM MOCKINGBIRD', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('ARABIA DOGMA', Decimal('0.99'), Decimal('29.99'), Decimal('31')),
 ('CLYDE THEORY', Decimal('0.99'), Decimal('29.99'), Decimal('31'))]

## LIMIT and OFFSET

> - limit acts as a cap for the maximum amount of rows

In [113]:
%%sql

select first_name, last_name
from customer
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('MARY', 'SMITH'),
 ('PATRICIA', 'JOHNSON'),
 ('LINDA', 'WILLIAMS'),
 ('BARBARA', 'JONES'),
 ('ELIZABETH', 'BROWN')]

In [114]:
%%sql

select first_name, last_name
from customer
order by first_name
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('AARON', 'SELBY'),
 ('ADAM', 'GOOCH'),
 ('ADRIAN', 'CLARY'),
 ('AGNES', 'BISHOP'),
 ('ALAN', 'KAHN')]

> - limit 5 offset 0 - skip 0 rows then return the next 5

In [115]:
%%sql

select first_name, last_name
from customer
order by first_name
limit 5 offset 0;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('AARON', 'SELBY'),
 ('ADAM', 'GOOCH'),
 ('ADRIAN', 'CLARY'),
 ('AGNES', 'BISHOP'),
 ('ALAN', 'KAHN')]

> - limit 5 offset 1 - skip 1 rows then return the next 5

In [116]:
%%sql

select first_name, last_name
from customer
order by first_name
limit 5 offset 1;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ADAM', 'GOOCH'),
 ('ADRIAN', 'CLARY'),
 ('AGNES', 'BISHOP'),
 ('ALAN', 'KAHN'),
 ('ALBERT', 'CROUSE')]

## DISTINCT

In [120]:
%%sql 

select * from payment
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577)),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577)),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577)),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577)),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577))]

In [122]:
%%sql 

select customer_id from payment
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(269,), (269,), (269,), (269,), (269,)]

> - distinct allows us to remove all the duplicate rows

In [124]:
%%sql 

select distinct customer_id from payment
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(1,), (2,), (3,), (4,), (5,)]

In [126]:
%%sql

select customer_id, staff_id from payment
where customer_id = 269
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(269, 2), (269, 1), (269, 2), (269, 2), (269, 1)]

In [128]:
%%sql

select distinct customer_id, staff_id from payment
where customer_id = 269;

 * postgresql://postgres:***@localhost/videoezy
2 rows affected.

[(269, 1), (269, 2)]

In [129]:
%%sql

select distinct
    date_part('month', payment_date) as month,
    date_part('year', payment_date) as year
from payment
order by year, month;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[(1.0, 2007.0), (2.0, 2007.0), (3.0, 2007.0), (4.0, 2007.0), (5.0, 2007.0)]

## Case Expressions

In [134]:
%%sql

select title, length,
    case
        when length <= 60 then 'short'
        when length > 60 and length <= 120 then 'long'
        when length > 120 then 'very long'
    end as length_description
from film
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACADEMY DINOSAUR', 86, 'long'),
 ('ACE GOLDFINGER', 48, 'short'),
 ('ADAPTATION HOLES', 50, 'short'),
 ('AFFAIR PREJUDICE', 117, 'long'),
 ('AFRICAN EGG', 130, 'very long')]

In [135]:
%%sql

select title, length,
    case
        when length <= 60 then 'short'
        when length > 60 and length <= 120 then 'long'
        when length > 120 then 'very long'
        else 'unknown'
    end as length_description
from film
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACADEMY DINOSAUR', 86, 'long'),
 ('ACE GOLDFINGER', 48, 'short'),
 ('ADAPTATION HOLES', 50, 'short'),
 ('AFFAIR PREJUDICE', 117, 'long'),
 ('AFRICAN EGG', 130, 'very long')]

In [138]:
%%sql

select title, length, rating,
    case rating
        when 'G' then 'kid friendly'
        when 'PG' then 'kid friendly'
        else 'not kid friendly'
    end as kid_friendly_rating
from film
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACADEMY DINOSAUR', 86, 'PG', 'kid friendly'),
 ('ACE GOLDFINGER', 48, 'G', 'kid friendly'),
 ('ADAPTATION HOLES', 50, 'NC-17', 'not kid friendly'),
 ('AFFAIR PREJUDICE', 117, 'G', 'kid friendly'),
 ('AFRICAN EGG', 130, 'G', 'kid friendly')]

In [139]:
%%sql

select title, length, rating,
    case 
        when rating='G' then 'kid friendly'
        when rating='PG' then 'kid friendly'
        else 'not kid friendly'
    end as kid_friendly_rating
from film
limit 5;

 * postgresql://postgres:***@localhost/videoezy
5 rows affected.

[('ACADEMY DINOSAUR', 86, 'PG', 'kid friendly'),
 ('ACE GOLDFINGER', 48, 'G', 'kid friendly'),
 ('ADAPTATION HOLES', 50, 'NC-17', 'not kid friendly'),
 ('AFFAIR PREJUDICE', 117, 'G', 'kid friendly'),
 ('AFRICAN EGG', 130, 'G', 'kid friendly')]